// Функція, яка перевіряє, чи є число простим
fn is_prime(x: u32) -> bool {
    // Всі числа менше або рівні 1 не є простими
    if x < 2 {
        return false;
    }
    // Перевіряємо ділення на всі числа від 2 до квадратного кореня з x
    for i in 2..=((x as f64).sqrt() as u32) {
        // Якщо x ділиться на i без залишку, то x не є простим
        if x % i == 0 {
            return false;
        }
    }
    // Якщо не знайдено дільників, число є простим
    true
}

fn main() {
    // Тести для перевірки функції
    assert_eq!(true, is_prime(13)); // 13 є простим числом
    assert_eq!(false, is_prime(12)); // 12 не є простим числом
}
